DataProcessors/ОбменСИнтернетМагазином.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ОбменСИнтернетМагазином</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтрагентыИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыИнтернетМагазина</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоменклатураИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураИнтернетМагазина</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment> Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment> Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment> Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment> Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификацияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовЭкономическойДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_ПостояннаяЧастьОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Внешняя</Name>
					<Comment>Признак того, что работа (услуга) выполняется сторонней организацией</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_ТелефонИнтернет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_ОплачиваетсяАвансом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_АгентскаяСхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_ВыводитьЕдиницуИзмеренияИЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_УслугаАренды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродукцияМаркируемаяДляГИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРаздел7ДекларацииНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийРаздела7ДекларацииПоНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтавкиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эко_ТипТары</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эко_ТипТары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МолочнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шины</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Духи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Велосипеды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КреслаКоляски</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотоаппараты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СредствоИндивидуальнойЗащиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНоменклатурнойКлассификацииККТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовНоменклатурыЧекаККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбменСИнтернетМагазином/Forms/ФормаСопоставления/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
	Если СопоставлятьКонтрагента Тогда
		Страница = "КОНТРАГЕНТ";
	ИначеЕсли СопоставлятьНоменклатуру Тогда
		Страница = "НОМЕНКЛАТУРА";
	КонецЕсли;
	
	ПереключитьСтраницы(ЭтотОбъект, Страница);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗагрузитьНастройкиНаСервере();
	
	ДокументСсылка = Параметры.ДокументСсылка;
	АдресХранилища = Параметры.АдресХранилища;
	
	ДанныеДляСпоставления = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	СопоставлятьНоменклатуру = ЗначениеЗаполнено(ДанныеДляСпоставления.Номенклатура);
	Если СопоставлятьНоменклатуру Тогда
		
		ЕдиницыИзмерения = Новый Соответствие;
		Для каждого СтрокаТаблицы из ДанныеДляСпоставления.Номенклатура Цикл
			НоваяСтрока = НоменклатураКСопоставлению.Добавить();
			НоваяСтрока.ДанныеНоменклатуры = СтрокаТаблицы.ДанныеНоменклатуры;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы.ДанныеНоменклатуры, "Наименование, Артикул, Услуга");
			НоваяСтрока.НомерСтрокиЗаказа = СтрокаТаблицы.НомерСтрокиЗаказа;
			НоваяСтрока.НаименованиеПредставление  = "Новый: " + НоваяСтрока.Наименование;
			НоваяСтрока.ИдентификаторНоменклатуры  = СтрокаТаблицы.Идентификатор;
			НоваяСтрока.ИдентификаторПредставление = "Код магазина: " + СтрокаТаблицы.Идентификатор;
			
			
			НоваяСтрока.ЗначокДействия             = 2;
			КодЕдиницы = СтрокаТаблицы.ДанныеНоменклатуры.Единица.Код;
			Если ЗначениеЗаполнено(КодЕдиницы) Тогда
				БазоваяЕдиница = ЕдиницыИзмерения.Получить(КодЕдиницы);
				Если БазоваяЕдиница = Неопределено Тогда
					БазоваяЕдиница = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(КодЕдиницы);
					ЕдиницыИзмерения.Вставить(КодЕдиницы, БазоваяЕдиница);
				КонецЕсли;
				НоваяСтрока.Единица                    = БазоваяЕдиница;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СопоставлятьКонтрагента = ЗначениеЗаполнено(ДанныеДляСпоставления.Контрагент);
	
	Если СопоставлятьКонтрагента Тогда
		ДанныеКонтрагента = ДанныеДляСпоставления.Контрагент;
		
		ДанныеПокупателя = ПредставлениеДанныхПокупателя(ДанныеКонтрагента);
		
		Если ПустаяСтрока(ДанныеПокупателя) Тогда
			СоздатьКонтрагента = 2;
			ДанныеПокупателя = НСтр("ru = '<Данные не указаны>'");
			Элементы.СоздатьКонтрагента.ТолькоПросмотр = Истина;
			Элементы.ВыбратьСуществующего.ТолькоПросмотр = Истина;
			УстановитьДоступностьВыбораКонтрагента(ЭтотОбъект);
		Иначе
			СоздатьКонтрагента = 1;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВсеДанныеСопоставлены Тогда
		
		ПараметрОповещения = Новый Структура;
		ПараметрОповещения.Вставить("Контрагент",                                       Контрагент);
		ПараметрОповещения.Вставить("ИдентификаторВызывающейФормы",                     ВладелецФормы.УникальныйИдентификатор);
		ПараметрОповещения.Вставить("АдресТаблицыСопоставленныхДанныхВХранилище",       АдресХранилища);
		ПараметрОповещения.Вставить("ДанныеСопоставленыАвтоматически",                  Истина);
		
		Оповестить("ЗаполненыДанныеИнтернетМагазин", ПараметрОповещения, ВладелецФормы);
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент Тогда
		
		РезультатСопоставления = РезультатСопоставления();
		
		ПараметрОповещения = Новый Структура;
		ПараметрОповещения.Вставить("Контрагент",                         РезультатСопоставления.Контрагент);
		ПараметрОповещения.Вставить("Номенклатура",                       РезультатСопоставления.Номенклатура);
		ПараметрОповещения.Вставить("ИдентификаторВызывающейФормы",       ВладелецФормы.УникальныйИдентификатор);
		
		Оповестить("ЗаполненыДанныеИнтернетМагазин", ПараметрОповещения, ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоздатьКонтрагентаПриИзменении(Элемент)
	УстановитьДоступностьВыбораКонтрагента(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено
		И НЕ ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ТекстПодбора = НСтр("ru = 'Создать: '")
			+ ТекДанные.Наименование
			+ ?(ПустаяСтрока(ТекДанные.Артикул), "", ", " + ТекДанные.Артикул)
			+ ?(ПустаяСтрока(ТекДанные.Единица), "", ", " + ТекДанные.Единица);
		ДанныеВыбора.Добавить(ТекстПодбора);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено 
		И ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеЗаполнения = Новый Структура();
		ДанныеЗаполнения.Вставить("НаименованиеПолное",   ТекДанные.Наименование);
		ДанныеЗаполнения.Вставить("Артикул",              ТекДанные.Артикул);
		ДанныеЗаполнения.Вставить("Услуга",               ТекДанные.Услуга);
		ДанныеЗаполнения.Вставить("НоменклатурнаяГруппа", НастройкиЗагрузки.НоменклатурнаяГруппа);
		ДанныеЗаполнения.Вставить("Родитель",             НастройкиЗагрузки.ГруппаНоменклатуры);
		
		Если ТекДанные.Услуга Тогда
			ДанныеЗаполнения.Вставить("ВидНоменклатуры",  НастройкиЗагрузки.ВидНоменклатурыУслуга);
		Иначе
			ДанныеЗаполнения.Вставить("ВидНоменклатуры",  НастройкиЗагрузки.ВидНоменклатуры);
		КонецЕсли;
		
		БазоваяЕдиница = ТекДанные.Единица;
		Если НЕ ТекДанные.Услуга
			И Не ЗначениеЗаполнено(БазоваяЕдиница) Тогда
			БазоваяЕдиница = НастройкиЗагрузки.ЕдиницаИзмерения;
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ЕдиницаИзмерения",     БазоваяЕдиница);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ТекДанные.Наименование);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта",ПараметрыФормы, Элемент);
	Иначе
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			ТекДанные.ЗначокДействия = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.ЗначокДействия = 0;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Назад(Команда)
	
	Страница = "";
	ТекущаяСтраница = Элементы.СтраницыМастера.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаНоменклатура И СопоставлятьКонтрагента Тогда
		Страница = "КОНТРАГЕНТ";
	КонецЕсли;
	
	ПереключитьСтраницы(ЭтотОбъект, Страница);
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Страница = "";
	ТекущаяСтраница = Элементы.СтраницыМастера.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаКонтрагент И СопоставлятьНоменклатуру Тогда
		Страница = "НОМЕНКЛАТУРА";
	КонецЕсли;
	
	ПереключитьСтраницы(ЭтотОбъект, Страница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкиОбменаСИнтернетМагазиномЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("НастройкаРеквизитов", Истина);
	ОткрытьФорму("Обработка.ОбменСИнтернетМагазином.Форма.ФормаНастройки",ПараметрыФормы,ЭтотОбъект,,,,ОповещениеОЗавершении);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПредставлениеДанныхПокупателя(ДанныеКонтрагента)
	
	Если СопоставлятьКонтрагента Тогда
		
		НаименованиеКонтрагента = "";
		Если НЕ ПустаяСтрока(ДанныеКонтрагента.ОфициальноеНаименование) Тогда
			НаименованиеКонтрагента = ДанныеКонтрагента.ОфициальноеНаименование;
		ИначеЕсли НЕ ДанныеКонтрагента.ЮрЛицо И НЕ ПустаяСтрока(ДанныеКонтрагента.ФИО) Тогда
			НаименованиеКонтрагента = ДанныеКонтрагента.ФИО;
		КонецЕсли;
		
		Если ПустаяСтрока(НаименованиеКонтрагента) Тогда
			Если ЗначениеЗаполнено(ДанныеКонтрагента.НаименованиеПолное) Тогда
				НаименованиеКонтрагента = ДанныеКонтрагента.НаименованиеПолное;
			Иначе
				НаименованиеКонтрагента = "-";
			КонецЕсли;
		КонецЕсли;
		
		ИНН = ДанныеКонтрагента.ИНН;
		КПП = ДанныеКонтрагента.КПП;
		
		ДанныеПокупателя = НаименованиеКонтрагента
			+ ?(ЗначениеЗаполнено(ИНН), ", " + "ИНН " + ИНН, "")
			+ ?(ЗначениеЗаполнено(КПП), ", " + "КПП " + КПП, "");
		АдресФакт = "";
		АдресЮр = "";
		Телефон = "";
		ЭП = "";
		
		Для Каждого СтрокаИнформации Из ДанныеКонтрагента.КонтактнаяИнформация Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаИнформации.Представление) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВРег(СтрокаИнформации.Вид) = ВРег("ФактическийАдрес") Тогда
				
				АдресФакт = СтрокаИнформации.Представление;
				
			ИначеЕсли ВРег(СтрокаИнформации.Вид) = ВРег("ЮридическийАдрес") Тогда
				
				АдресЮр = СтрокаИнформации.Представление;
				
			ИначеЕсли ВРег(СтрокаИнформации.Вид) = ВРег("ТелефонРабочий")
				ИЛИ ВРег(СтрокаИнформации.Вид) = ВРег("ТелефонВнутренний")
				ИЛИ ВРег(СтрокаИнформации.Вид) = ВРег("ТелефонМобильный")
				ИЛИ ВРег(СтрокаИнформации.Вид) = ВРег("ТелефонДомашний") Тогда
				
				Телефон = СтрокаИнформации.Представление;
				
			ИначеЕсли ВРег(СтрокаИнформации.Вид) = ВРег("Почта")
				ИЛИ ВРег(СтрокаИнформации.Вид) = ВРег("ЭлектроннаяПочта") Тогда
				
				ЭП = СтрокаИнформации.Представление;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеПокупателя = ДанныеПокупателя
			+ ?(ЗначениеЗаполнено(Телефон),", " + "тел.: " + Телефон, "")
			+ ?(ЗначениеЗаполнено(ЭП), ", " + "Email: " + ЭП, "")
			+ ?(ЗначениеЗаполнено(АдресЮр), ", " + "Адрес:" + АдресЮр, "")
			+ ?(НЕ ЗначениеЗаполнено(АдресЮр) И ЗначениеЗаполнено(АдресФакт), ", " + "Адрес: " + АдресФакт, "");
			
	КонецЕсли;
	
	Возврат ДанныеПокупателя;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВыбораКонтрагента(Форма)
	Форма.Элементы.Контрагент.Доступность = Форма.СоздатьКонтрагента = 2;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Серый текст для новой номенклатуры
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатура");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НоменклатураКСопоставлению.Номенклатура", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСерый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("НоменклатураКСопоставлению.НаименованиеПредставление"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбменаСИнтернетМагазиномЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере()
	
	ВидНоменклатурыУслуга = Справочники.ВидыНоменклатуры.ЭлементВидНоменклатурыПоУмолчанию(Истина);
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	
	НастройкиЗагрузки = ОбменСИнтернетМагазином.ПолучитьНастройкиОбмена();
	НастройкиЗагрузки.Вставить("ВидНоменклатурыУслуга", ВидНоменклатурыУслуга);
	НастройкиЗагрузки.Вставить("ЕдиницаИзмерения",      ЕдиницаИзмерения);
	
КонецПроцедуры

&НаСервере
Функция РезультатСопоставления()
	
	РезультатСопоставления = Новый Структура;
	РезультатСопоставления.Вставить("Контрагент");
	РезультатСопоставления.Вставить("Номенклатура", Новый Соответствие);
	
	Если СопоставлятьКонтрагента Тогда
		ДанныеДляСпоставления = ПолучитьИзВременногоХранилища(АдресХранилища);
		ДанныеКонтрагента = ДанныеДляСпоставления.Контрагент;
		Если СоздатьКонтрагента = 1 Тогда
			Контрагент = ОбменСИнтернетМагазином.СоздатьКонтрагента(ДанныеКонтрагента,
				НастройкиЗагрузки.Организация,
				НастройкиЗагрузки.ГруппаКонтрагентов);
		КонецЕсли;
	
		РегистрыСведений.КонтрагентыИнтернетМагазина.УстановитьСоответствие(ДанныеКонтрагента.Идентификатор, Контрагент);
		РезультатСопоставления.Контрагент = Контрагент;
		
	КонецЕсли;
	
	Если СопоставлятьНоменклатуру Тогда
		
		Для каждого НоменклатураКСопоставлениюСтрока Из НоменклатураКСопоставлению Цикл
			
			Если Не ЗначениеЗаполнено(НоменклатураКСопоставлениюСтрока.Номенклатура) Тогда
				
				НоменклатураКСопоставлениюСтрока.Номенклатура =
					ОбменСИнтернетМагазином.СоздатьНоменклатуру(НоменклатураКСопоставлениюСтрока.ДанныеНоменклатуры, НастройкиЗагрузки);
			КонецЕсли;
			
			РезультатСопоставления.Номенклатура.Вставить(НоменклатураКСопоставлениюСтрока.НомерСтрокиЗаказа, НоменклатураКСопоставлениюСтрока.Номенклатура);
			
			РегистрыСведений.НоменклатураИнтернетМагазина.УстановитьСоответствие(
				НоменклатураКСопоставлениюСтрока.ИдентификаторНоменклатуры,
				НоменклатураКСопоставлениюСтрока.Номенклатура);
				
		КонецЦикла;
		
	КонецЕсли;
	
	ОбменСИнтернетМагазином.УдалитьДанныеДляСопоставления(ДокументСсылка);
	
	Возврат РезультатСопоставления;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура ПереключитьСтраницы(Форма, Страница)
	
	КнопкаНазад = Ложь;
	КнопкаДалее = Ложь;
	
	Элементы = Форма.Элементы;
	Если Страница = "КОНТРАГЕНТ" Тогда
		Элементы.СтраницыМастера.ТекущаяСтраница = Элементы.СтраницаКонтрагент;
		
		Форма.Заголовок = НСтр("ru = 'Помощник сопоставления контрагентов'");
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru = 'Сопоставьте покупателя интернет-магазина с данными в информационной базе'");
		
		КнопкаДалее = Форма.СопоставлятьНоменклатуру;
		
	ИначеЕсли Страница = "НОМЕНКЛАТУРА" Тогда
		Элементы.СтраницыМастера.ТекущаяСтраница = Элементы.СтраницаНоменклатура;
		
		КнопкаНазад = Форма.СопоставлятьКонтрагента;
		
		Форма.Заголовок = НСтр("ru = 'Помощник сопоставления номенклатуры'");
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru = 'Сопоставьте товары и услуги интернет-магазина с данными в информационной базе'");
	КонецЕсли;
	
	КоличествоСтраниц = ?(Форма.СопоставлятьНоменклатуру,1,0) + ?(Форма.СопоставлятьКонтрагента,1,0);
	
	Элементы.ФормаПеренестиВДокумент.Видимость = (КоличествоСтраниц = 1) ИЛИ (Страница = "НОМЕНКЛАТУРА");
	Элементы.ФормаНазад.Видимость = КнопкаНазад;
	Элементы.ФормаДалее.Видимость = КнопкаДалее;
	
	Элементы.ФормаДалее.КнопкаПоУмолчанию = Элементы.ФормаДалее.Видимость;
	Элементы.ФормаПеренестиВДокумент.КнопкаПоУмолчанию = Элементы.ФормаПеренестиВДокумент.Видимость;

	
КонецПроцедуры

#КонецОбласти
